#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.aws_caller_identity.current: Reading...
module.vpc_gateway.aws_vpc.main: Refreshing state... [id=vpc-09b034b9bb716ae48]
module.vpc_gateway.data.aws_availability_zones.available: Reading...
module.vpc_backend.data.aws_availability_zones.available: Reading...
module.eks_backend.aws_iam_role.cluster[0]: Refreshing state... [id=eks-backend-eks-cluster-role]
module.eks_gateway.aws_iam_role.cluster[0]: Refreshing state... [id=eks-gateway-eks-cluster-role]
module.vpc_backend.aws_vpc.main: Refreshing state... [id=vpc-0704bfac28c9294c7]
module.eks_gateway.aws_iam_role.node_group[0]: Refreshing state... [id=eks-gateway-eks-node-role]
module.eks_backend.aws_iam_role.node_group[0]: Refreshing state... [id=eks-backend-eks-node-role]
data.aws_caller_identity.current: Read complete after 0s [id=721500739616]
module.vpc_gateway.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc_backend.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.eks_gateway.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceController[0]: Refreshing state... [id=eks-gateway-eks-cluster-role-20251021142534947400000005]
module.eks_gateway.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=eks-gateway-eks-cluster-role-20251021142534846100000001]
module.eks_gateway.aws_iam_role_policy_attachment.node_group_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=eks-gateway-eks-node-role-20251021142534875600000003]
module.eks_gateway.aws_iam_role_policy_attachment.node_group_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=eks-gateway-eks-node-role-20251021142534923900000004]
module.eks_gateway.aws_iam_role_policy_attachment.node_group_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=eks-gateway-eks-node-role-20251021142534875000000002]
module.eks_gateway.aws_iam_role_policy.node_group_load_balancer[0]: Refreshing state... [id=eks-gateway-eks-node-role:eks-gateway-node-loadbalancer-policy]
module.vpc_gateway.aws_subnet.private[1]: Refreshing state... [id=subnet-0420903a428f2d45b]
module.vpc_gateway.aws_internet_gateway.main: Refreshing state... [id=igw-019af2349c77b63e7]
module.vpc_gateway.aws_subnet.public[1]: Refreshing state... [id=subnet-0e4e5d06536cf0b93]
module.vpc_gateway.aws_subnet.public[0]: Refreshing state... [id=subnet-0e99b85d6fe823c70]
module.eks_gateway.aws_security_group.cluster: Refreshing state... [id=sg-0de1de05095ba598f]
module.vpc_gateway.aws_subnet.private[0]: Refreshing state... [id=subnet-0f6bdbe631ddd4533]
module.vpc_gateway.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0fd0798beaec01be0]
module.vpc_gateway.aws_route_table.public: Refreshing state... [id=rtb-094bdc2824dd38513]
module.vpc_gateway.aws_eip.nat[0]: Refreshing state... [id=eipalloc-08cb8cc0884389910]
module.vpc_backend.aws_subnet.private[1]: Refreshing state... [id=subnet-0a9c7c4a4e9c56f26]
module.vpc_backend.aws_subnet.private[0]: Refreshing state... [id=subnet-035c79fdb38084ef0]
module.vpc_backend.aws_internet_gateway.main: Refreshing state... [id=igw-0f4d68189c379170b]
module.vpc_backend.aws_subnet.public[0]: Refreshing state... [id=subnet-0a1710672f6f31f00]
module.vpc_backend.aws_subnet.public[1]: Refreshing state... [id=subnet-000f27c7eb45eba2e]
module.vpc_peering.aws_vpc_peering_connection.main: Refreshing state... [id=pcx-095e2f9f6494f1db1]
module.eks_backend.aws_security_group.cluster: Refreshing state... [id=sg-0a706387ded4d5f09]
module.vpc_backend.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e3e33852d656f1a0]
module.vpc_backend.aws_route_table.public: Refreshing state... [id=rtb-061af53daf32655ed]
module.vpc_backend.aws_eip.nat[0]: Refreshing state... [id=eipalloc-082e751678beb3ad5]
module.eks_security.aws_security_group_rule.gateway_allow_backend: Refreshing state... [id=sgrule-3666620193]
module.vpc_gateway.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01ee6961b578b3594]
module.vpc_gateway.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0003acd6846a8c577]
module.eks_gateway.aws_eks_cluster.main: Refreshing state... [id=gateway]
module.vpc_gateway.aws_nat_gateway.main[0]: Refreshing state... [id=nat-09d6c52b591442318]
module.vpc_gateway.aws_nat_gateway.main[1]: Refreshing state... [id=nat-0e641392243d19a9b]
module.vpc_backend.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0366db989e1106497]
module.vpc_backend.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ce0bee9666675156]
module.eks_security.aws_security_group_rule.backend_allow_gateway: Refreshing state... [id=sgrule-2280436154]
module.vpc_gateway.aws_route_table.private[0]: Refreshing state... [id=rtb-01d5a76f094367d98]
module.vpc_gateway.aws_route_table.private[1]: Refreshing state... [id=rtb-0bdebb044fd241e60]
module.vpc_gateway.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0de5cbe96a74d0eb5]
module.vpc_gateway.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f71b545e07752efe]
module.vpc_backend.aws_nat_gateway.main[0]: Refreshing state... [id=nat-055b4c11bd25941bd]
module.vpc_peering.aws_route.vpc_to_peer[1]: Refreshing state... [id=r-rtb-0bdebb044fd241e603322942084]
module.vpc_backend.aws_nat_gateway.main[1]: Refreshing state... [id=nat-0e4cbe89bd897d123]
module.vpc_peering.aws_route.vpc_to_peer[0]: Refreshing state... [id=r-rtb-01d5a76f094367d983322942084]
module.vpc_backend.aws_route_table.private[0]: Refreshing state... [id=rtb-074459c5a8868ca46]
module.vpc_backend.aws_route_table.private[1]: Refreshing state... [id=rtb-0f7141330b45dd52d]
module.eks_gateway.aws_eks_node_group.main: Refreshing state... [id=gateway:gateway-node-group]
module.vpc_backend.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a6af223178c7f59d]
module.vpc_backend.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-024eb02e17fa393cd]
module.vpc_peering.aws_route.peer_to_vpc[1]: Refreshing state... [id=r-rtb-0f7141330b45dd52d179966490]
module.vpc_peering.aws_route.peer_to_vpc[0]: Refreshing state... [id=r-rtb-074459c5a8868ca46179966490]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks_backend.aws_eks_cluster.main will be created
  + resource "aws_eks_cluster" "main" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "backend"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "backend-eks"
          + "Type" = "backend"
        }
      + tags_all                      = {
          + "Name" = "backend-eks"
          + "Type" = "backend"
        }
      + version                       = "1.28"

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-0a706387ded4d5f09",
            ]
          + subnet_ids                = [
              + "subnet-035c79fdb38084ef0",
              + "subnet-0a9c7c4a4e9c56f26",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks_backend.aws_eks_node_group.main will be created
  + resource "aws_eks_node_group" "main" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "backend"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "backend-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-035c79fdb38084ef0",
          + "subnet-0a9c7c4a4e9c56f26",
        ]
      + tags                   = {
          + "Name" = "backend-node-group"
          + "Type" = "backend"
        }
      + tags_all               = {
          + "Name" = "backend-node-group"
          + "Type" = "backend"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks_backend.aws_iam_role.cluster[0] will be replaced, as requested
-/+ resource "aws_iam_role" "cluster" {
      ~ arn                   = "arn:aws:iam::721500739616:role/eks-backend-eks-cluster-role" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "sts:TagSession",
                          - "sts:AssumeRole",
                        ] -> "sts:AssumeRole"
                      - Sid       = "EKSClusterAssumeRole"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ create_date           = "2025-07-14T13:29:03Z" -> (known after apply)
      ~ id                    = "eks-backend-eks-cluster-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
        name                  = "eks-backend-eks-cluster-role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2P7GLTAQCPJPWGMU2" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks_backend.aws_iam_role.node_group[0] will be replaced, as requested
-/+ resource "aws_iam_role" "node_group" {
      ~ arn                   = "arn:aws:iam::721500739616:role/eks-backend-eks-node-role" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      - Sid       = "EKSNodeAssumeRole"
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ create_date           = "2025-07-14T13:29:03Z" -> (known after apply)
      ~ id                    = "eks-backend-eks-node-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> (known after apply)
        name                  = "eks-backend-eks-node-role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2P7GLTAQJAJRGRTU4" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks_backend.aws_iam_role_policy.node_group_load_balancer[0] will be created
  + resource "aws_iam_role_policy" "node_group_load_balancer" {
      + id          = (known after apply)
      + name        = "eks-backend-node-loadbalancer-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.eks_backend.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-backend-eks-cluster-role"
    }

  # module.eks_backend.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceController[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-backend-eks-cluster-role"
    }

  # module.eks_backend.aws_iam_role_policy_attachment.node_group_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "node_group_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-backend-eks-node-role"
    }

  # module.eks_backend.aws_iam_role_policy_attachment.node_group_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "node_group_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-backend-eks-node-role"
    }

  # module.eks_backend.aws_iam_role_policy_attachment.node_group_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "node_group_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-backend-eks-node-role"
    }

  # module.eks_gateway.aws_eks_cluster.main must be replaced
-/+ resource "aws_eks_cluster" "main" {
      ~ arn                           = "arn:aws:eks:us-east-2:721500739616:cluster/gateway" -> (known after apply)
      ~ certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJVmh0MmJaVUV3U3d3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRFd01qRXhOREkyTURsYUZ3MHpOVEV3TVRreE5ETXhNRGxhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURRQkx2VXVRaERoakZ1TldEVVpJNTlJNlRhNkVhaHQxTGJIa2dpNERtdlphR2JsZmNGUVZJZm1OQXYKK0EzZHZWQjY1L1ZhSk5VdUlxR1g2b2ZaTlVOS1h5SjJJWGw4dUh2Z293QmZpSlRlNjlVVlE3Y2tTamZTYUlYTwphbjJFVG1NVE9IbThPM0REdE9pcktLQTB0Y1h1eVhNQVFmMXV6RzZlWkVFUmVrbXcwSFVTWWowZURCb1RDa2FTCktZQ2xTdTlDMyt6NnNRZVBUa0NzYWx3YlVLWDQxMUJocDE0a0d5TkNPbkdpN3VFWERpbE1LQ1FrQjUzbHREeHYKOFhwNHYzVTh1QUZ5VitWR29qU3B4R3BGZXpDanZUd0djaExYbWlmZ29Uc21KREJqY0VRbk0wM0ZDckx2V1NhRgpZV3J0Mm8rc0RIek5OYXhJY3RDMVpucHZMTC9WQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUaGdyNlhPaG9maFZpY1JYenhSWnlQT2hsM1VUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUFVT25IZ2FTVwpHczBsZyt6amJmcDRISzNaOW40U2ZPT0lwSUVSWTM1eFFRU3BsZG5RN2xUbmEwSjZVTXI0N1JsK0IrN2czbEVnCk5CckRiTEwzMFZMZDhCZjZLQ28xcnQvR0FlUC9NeWhmT21tQ3lkOGthYkxtVGlVenFmViswdUhZbTN3cGVPNUMKampJQ2pUenE1eVN1MGFncEFzM2U2Vm94anV2NG9USUxWUldSOFFNaGVyTFhBcE00RUcrY1VQRDQxVk5obnpkbwovNmh3UGtBMzBqVjZFemlsVVZLV2V0emtaL09rdzcvemMyRTNvMVc2aVlWUzF0bWJjNHlobWRRcjB3blBIdWhlCi9LOExNMGg5eW94eTRHNGZUOHlVV0YxbXFmcVpEd3Z4SVNIcnZGbHRBUjYzNlRCclJQZjBUcWw3eDBpSGdrZzQKeHA0YkVWVnErcFFVCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                    = (known after apply)
      ~ created_at                    = "2025-10-21T14:25:37Z" -> (known after apply)
      ~ endpoint                      = "https://91F3B8204C4C7829EE7858379B13B4FF.gr7.us-east-2.eks.amazonaws.com" -> (known after apply)
      ~ id                            = "gateway" -> (known after apply)
      ~ identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-2.amazonaws.com/id/91F3B8204C4C7829EE7858379B13B4FF"
                    },
                ]
            },
        ] -> (known after apply)
        name                          = "gateway"
      ~ platform_version              = "eks.58" -> (known after apply)
      ~ role_arn                      = "arn:aws:iam::721500739616:role/eks-gateway-eks-cluster-role" # forces replacement -> (known after apply) # forces replacement
      ~ status                        = "ACTIVE" -> (known after apply)
        tags                          = {
            "Name" = "gateway-eks"
            "Type" = "gateway"
        }
        # (4 unchanged attributes hidden)

      - access_config {
          - authentication_mode                         = "CONFIG_MAP" -> null
          - bootstrap_cluster_creator_admin_permissions = true -> null
        }

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0f1a3d0774aa762bc" -> (known after apply)
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> (known after apply)
          ~ vpc_id                    = "vpc-09b034b9bb716ae48" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.eks_gateway.aws_eks_node_group.main must be replaced
-/+ resource "aws_eks_node_group" "main" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-2:721500739616:nodegroup/gateway/gateway-node-group/70cd0398-b44b-736f-bf4c-4b7daf1845af" -> (known after apply)
      ~ id                     = "gateway:gateway-node-group" -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ node_role_arn          = "arn:aws:iam::721500739616:role/eks-gateway-eks-node-role" # forces replacement -> (known after apply) # forces replacement
      ~ release_version        = "1.28.15-20251007" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-gateway-node-group-70cd0398-b44b-736f-bf4c-4b7daf1845af"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "gateway-node-group"
            "Type" = "gateway"
        }
      ~ version                = "1.28" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.eks_gateway.aws_iam_role.cluster[0] will be replaced, as requested
-/+ resource "aws_iam_role" "cluster" {
      ~ arn                   = "arn:aws:iam::721500739616:role/eks-gateway-eks-cluster-role" -> (known after apply)
      ~ create_date           = "2025-10-21T14:25:34Z" -> (known after apply)
      ~ id                    = "eks-gateway-eks-cluster-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
        name                  = "eks-gateway-eks-cluster-role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2P7GLTAQJM7A2FPZX" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks_gateway.aws_iam_role.node_group[0] will be replaced, as requested
-/+ resource "aws_iam_role" "node_group" {
      ~ arn                   = "arn:aws:iam::721500739616:role/eks-gateway-eks-node-role" -> (known after apply)
      ~ create_date           = "2025-10-21T14:25:34Z" -> (known after apply)
      ~ id                    = "eks-gateway-eks-node-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> (known after apply)
        name                  = "eks-gateway-eks-node-role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2P7GLTAQEENRHTOIL" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {
          - name   = "eks-gateway-node-loadbalancer-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ec2:DescribeAccountAttributes",
                              - "ec2:DescribeAddresses",
                              - "ec2:DescribeInternetGateways",
                              - "ec2:DescribeVpcs",
                              - "ec2:DescribeSubnets",
                              - "ec2:DescribeSecurityGroups",
                              - "ec2:DescribeInstances",
                              - "ec2:DescribeNetworkInterfaces",
                              - "ec2:DescribeTags",
                              - "ec2:CreateSecurityGroup",
                              - "ec2:CreateTags",
                              - "ec2:DeleteTags",
                              - "ec2:AuthorizeSecurityGroupIngress",
                              - "ec2:RevokeSecurityGroupIngress",
                              - "ec2:DeleteSecurityGroup",
                              - "elasticloadbalancing:DescribeLoadBalancers",
                              - "elasticloadbalancing:DescribeLoadBalancerAttributes",
                              - "elasticloadbalancing:DescribeListeners",
                              - "elasticloadbalancing:DescribeListenerCertificates",
                              - "elasticloadbalancing:DescribeTargetGroups",
                              - "elasticloadbalancing:DescribeTargetGroupAttributes",
                              - "elasticloadbalancing:DescribeTargetHealth",
                              - "elasticloadbalancing:DescribeTags",
                              - "elasticloadbalancing:CreateLoadBalancer",
                              - "elasticloadbalancing:CreateListener",
                              - "elasticloadbalancing:CreateTargetGroup",
                              - "elasticloadbalancing:DeleteLoadBalancer",
                              - "elasticloadbalancing:DeleteListener",
                              - "elasticloadbalancing:DeleteTargetGroup",
                              - "elasticloadbalancing:ModifyLoadBalancerAttributes",
                              - "elasticloadbalancing:ModifyTargetGroup",
                              - "elasticloadbalancing:ModifyTargetGroupAttributes",
                              - "elasticloadbalancing:RegisterTargets",
                              - "elasticloadbalancing:DeregisterTargets",
                              - "elasticloadbalancing:SetSecurityGroups",
                              - "elasticloadbalancing:SetSubnets",
                              - "elasticloadbalancing:AddTags",
                              - "elasticloadbalancing:RemoveTags",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.eks_gateway.aws_iam_role_policy.node_group_load_balancer[0] must be replaced
-/+ resource "aws_iam_role_policy" "node_group_load_balancer" {
      ~ id          = "eks-gateway-eks-node-role:eks-gateway-node-loadbalancer-policy" -> (known after apply)
        name        = "eks-gateway-node-loadbalancer-policy"
      + name_prefix = (known after apply)
      ~ role        = "eks-gateway-eks-node-role" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc_peering.aws_route.peer_to_vpc[0] will be created
  + resource "aws_route" "peer_to_vpc" {
      + destination_cidr_block    = "10.0.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-074459c5a8868ca46"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-095e2f9f6494f1db1"
    }

  # module.vpc_peering.aws_route.peer_to_vpc[1] will be created
  + resource "aws_route" "peer_to_vpc" {
      + destination_cidr_block    = "10.0.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-0f7141330b45dd52d"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-095e2f9f6494f1db1"
    }

  # module.vpc_peering.aws_route.vpc_to_peer[0] will be created
  + resource "aws_route" "vpc_to_peer" {
      + destination_cidr_block    = "10.1.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-01d5a76f094367d98"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-095e2f9f6494f1db1"
    }

  # module.vpc_peering.aws_route.vpc_to_peer[1] will be created
  + resource "aws_route" "vpc_to_peer" {
      + destination_cidr_block    = "10.1.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-0bdebb044fd241e60"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-095e2f9f6494f1db1"
    }

Plan: 19 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rapydevops-gh, Action: `pull_request`, Workflow: `Terraform Infrastructure`*